# Задание №1
Далее в ячейках markdown встречаются цитаты. Это прямые цитаты из задания, опубликованного в нашей гугл-группе.

# 0

Скачиваем указанный датасет **train.csv** к задаче **Titanic**.  
Импорт нужных модулей:

In [1]:
import pandas            as pd

# 1
>загрузить датасет

In [2]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 2
>удалить колонки 'Ticket','Cabin' в которых содержится очень много "пустых" (n/a) значений

Посмотрим на количество NaN'ов в этих колонках:

In [3]:
print("NaNs in the \"Cabin\"  column:", df['Cabin' ].isnull().sum())
print("NaNs in the \"Ticket\" column:", df['Ticket'].isnull().sum())

NaNs in the "Cabin"  column: 687
NaNs in the "Ticket" column: 0

Видно, что в проблема с NaN'ами есть только в колонке "Cabin". Однако, в силу очевидной бесполезности колонки "Ticket", удаляем в соответствии с заданием обе колонки:

In [4]:
df.drop(['Ticket', 'Cabin'], axis = 1, inplace = True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

# 3
>удалить строки в которых все еще есть n/a

In [5]:
print("Number of rows before dropna:", df.shape[0])
df.dropna(inplace = True)
print("Number of rows after  dropna:", df.shape[0])

Number of rows before dropna: 891
Number of rows after  dropna: 712

# 4
>добавить колонку SexId = 0 if Sex == "male" else 1  
>добавить аналогичную колонку EmbarkedId

В случае пола имеем два возможных значения, поэтому SexId строим весьма быстро.  
В случае EmbarkedId их может быть больше (как ниже выясняется, встречаются три разных значения).

In [6]:
print("Number of unique values in the 'Sex' column:", len(df['Sex'].unique()))
df["SexId"] = (df["Sex"] == "male").astype(int)

print("Number of unique values in the 'Embarked' column:", len(df['Embarked'].unique()))
df["EmbarkedId"] = df['Embarked'].rank(method='dense') - 1

df.head()

Number of unique values in the 'Sex' column: 2
Number of unique values in the 'Embarked' column: 3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,SexId,EmbarkedId
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,1,2.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,0,0.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,0,2.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,0,2.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,1,2.0